# Data Cleaning and Preparation

In [1]:
import numpy as np
import pandas as pd

## Handling Missing Data

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [5]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

* Herhangi bir satirda NaN varsa o satiri komple ucurur...

In [8]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

* Satirin tamami Null sa ucurulmasi icin...

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

* Simdi aynisini sutunlar icin ucurucak...

In [11]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

### Filling In Missing Data

In [12]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.175056       NaN       NaN
1 -1.307405       NaN       NaN
2  0.205603       NaN -0.517678
3 -1.389286       NaN  0.420934
4  0.588734 -1.181231  0.079353
5 -1.395435  0.847736 -0.313511
6 -1.354516  0.294731  0.619204

In [13]:
df.fillna(0)

          0         1         2
0  0.175056  0.000000  0.000000
1 -1.307405  0.000000  0.000000
2  0.205603  0.000000 -0.517678
3 -1.389286  0.000000  0.420934
4  0.588734 -1.181231  0.079353
5 -1.395435  0.847736 -0.313511
6 -1.354516  0.294731  0.619204

* Birinci sutundaki bos yerleri 0.5 ile, ikinci sutundaki bos yerleri 0 ile doldurur...

In [14]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.175056  0.500000  0.000000
1 -1.307405  0.500000  0.000000
2  0.205603  0.500000 -0.517678
3 -1.389286  0.500000  0.420934
4  0.588734 -1.181231  0.079353
5 -1.395435  0.847736 -0.313511
6 -1.354516  0.294731  0.619204

In [ ]:
df.fillna(0, inplace=True)
df

* Doldururken nasil dolduracagini hem asagidaki gibi hem de metodun parametreleriyle belirleyebilirsin, bunu incele bence cunku baya onemli bir nokta...

In [15]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [16]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [17]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

* Son satiri ucurur.

In [18]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [19]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [20]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

* **Hem k1 hem k2 si** ayni olanlari ucurur, keep=last parametresi bastakileri degil sondakileri birakir. Yani sondakileri dusurmek yerine ondekileri dusurur. Biraz detay...

In [21]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [22]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [23]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [24]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

* Map hem bir dict hem de fonksiyon alabilir arguman olarak...

In [25]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

* meat to animal da x'i yani o satirdaki yiyecegin kucuk harfli halini key olarak veriyor. Daha sonra gelen value'yi aliyor.

In [26]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [27]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [28]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [29]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [30]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [31]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [32]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [33]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [40]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

* title ilk harfi buyuk harfe cevirir.

In [41]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [42]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [43]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [46]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

* Ilk deger haric son deger dahil sekilde 18-25 25-35... kategorilerine ayiriyor veriyi. Her bir elemanin hangi kategoriye denk geldigini dondurur...

In [47]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [48]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [49]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [50]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

* Kategorilerin koseli parantezinin ne tarafta olacagini ayarlayabilirsin...

In [51]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

* Kategorilere isim de verebilirsin...

In [52]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

* Simdi bolme yerlerini tanimlamak yerine kaca bolunecegini tanimliyoruz. precision sanirim ondalik degerde alinacak rakamlar, emin degilim. Parcalar esit oluyor...

In [57]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.74, 0.97], (0.057, 0.28], (0.057, 0.28], (0.28, 0.51], (0.28, 0.51], ..., (0.74, 0.97], (0.057, 0.28], (0.057, 0.28], (0.057, 0.28], (0.057, 0.28]]
Length: 20
Categories (4, interval[float64]): [(0.057, 0.28] < (0.28, 0.51] < (0.51, 0.74] < (0.74, 0.97]]

In [58]:
pd.cut(ages,4,precision=2)

[(19.96, 30.25], (19.96, 30.25], (19.96, 30.25], (19.96, 30.25], (19.96, 30.25], ..., (30.25, 40.5], (50.75, 61.0], (40.5, 50.75], (40.5, 50.75], (30.25, 40.5]]
Length: 12
Categories (4, interval[float64]): [(19.96, 30.25] < (30.25, 40.5] < (40.5, 50.75] < (50.75, 61.0]]

* Simdi ceyreklerine boluyor. Her ceyrekte ayni sayida eleman olacak sekilde boluyor. Asagidaki ornekte her ceyrekte 250 eleman bulunuyor ornegin...

In [59]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats

[(-0.015, 0.693], (-0.657, -0.015], (-0.015, 0.693], (-0.015, 0.693], (-0.657, -0.015], ..., (-0.657, -0.015], (-0.657, -0.015], (-3.9299999999999997, -0.657], (-0.657, -0.015], (-0.015, 0.693]]
Length: 1000
Categories (4, interval[float64]): [(-3.9299999999999997, -0.657] < (-0.657, -0.015] < (-0.015, 0.693] < (0.693, 3.417]]

In [60]:
pd.value_counts(cats)

(0.693, 3.417]                   250
(-0.015, 0.693]                  250
(-0.657, -0.015]                 250
(-3.9299999999999997, -0.657]    250
dtype: int64

* Simdi dilimleri sen belirtiyorsun ceyrekliklere bolmek yerine. Yani ilki 0-%10 ikincisi %10-%50 gibi...

In [61]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.015, 1.273], (-1.211, -0.015], (-0.015, 1.273], (-0.015, 1.273], (-1.211, -0.015], ..., (-1.211, -0.015], (-1.211, -0.015], (-1.211, -0.015], (-1.211, -0.015], (-0.015, 1.273]]
Length: 1000
Categories (4, interval[float64]): [(-3.9299999999999997, -1.211] < (-1.211, -0.015] < (-0.015, 1.273] < (1.273, 3.417]]

### Detecting and Filtering Outliers

In [62]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.014074    -0.024232    -0.003759    -0.018436
std       0.980771     0.986010     0.980442     0.974111
min      -3.202072    -3.416697    -2.770577    -3.344598
25%      -0.630087    -0.653938    -0.704687    -0.679232
50%       0.014645    -0.012195    -0.016119    -0.004984
75%       0.652011     0.618698     0.664420     0.638012
max       3.177781     2.848246     3.906676     2.626283

In [63]:
col = data[2]
col[np.abs(col) > 3]

496    3.120226
754    3.906676
Name: 2, dtype: float64

* Simdi herhangi bir sutununda sarti saglayan ifadelerin tumunu gormek icin...

In [64]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
35  -0.236556 -0.116744 -0.734654 -3.344598
73   0.395450  1.315322  0.429699 -3.026574
255 -1.719890 -3.416697 -0.367974 -0.971912
287  3.177781 -0.425322  1.059077  1.163109
402  0.943180  1.124101 -1.205358 -3.260737
487 -3.202072 -0.046882 -0.775032  0.918842
496  0.771764 -0.558029  3.120226  0.856976
709  3.126974  1.434177  0.086894 -0.353639
754 -0.106015  0.359355  3.906676 -0.885542

### Permutation and Random Sampling

* Simdi rastgele eleman cekmeye calisacagiz...

In [81]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [82]:
sampler = np.random.permutation(5)
sampler

array([3, 0, 2, 1, 4])

* take verilen array'i index gibi kullanir.

In [83]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [85]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11

In [88]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

4    4
0    5
4    4
0    5
3    6
2   -1
3    6
0    5
2   -1
0    5
dtype: int64

### Computing Indicator/Dummy Variables

In [70]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

* Kategorik degiskenleri sayisal degiskenlere cevirir.

In [71]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [72]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## String Manipulation

### String Object Methods

In [73]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [74]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [75]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [76]:
'::'.join(pieces)

'a::b::guido'

In [77]:
'guido' in val

True

In [78]:
val.index(',')

1

In [79]:
val.find(':')

-1

In [ ]:
val.index(':')

In [ ]:
val.count(',')

In [ ]:
val.replace(',', '::')

In [ ]:
val.replace(',', '')